Tekla Open API Reference for Tekla Structures 2025
IObjectAlignedBoundingBox Interface
 The IObjectAlignedBoundingBox interface is implemented by objects that have an object aligned bounding box.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IObjectAlignedBoundingBox
Public Interface IObjectAlignedBoundingBox
The IObjectAlignedBoundingBox type exposes the following members.
Methods
Name | Description
GetObjectAlignedBoundingBox
 Gets the bounding box for the current object in its local coordinate system.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace